InformationRegisters/МинимальнаяСтоимостьПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МинимальнаяСтоимостьПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокНаценкиМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МинимальнаяСтоимостьПродукции/Ext/ManagerModule.bsl
Функция ПолучитьМинимальнуюСтоимость(Знач ДатаЦены, Знач ВидЦены, Знач Валюта, 
									 Знач Организация, Знач Подразделение, 
									 Знач ФактураШаблон, Знач ЦветФактуры = Неопределено, 
									 Знач ВидНоменклатуры) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Стоимость", 0);
	СтруктураВозврата.Вставить("СпособОпределения");
	СтруктураВозврата.Вставить("ПорядокНаценки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Фактура КАК Фактура,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ЦветФактуры КАК ЦветФактуры,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Шаблон КАК Шаблон,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Стоимость КАК Стоимость,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.СпособОпределения КАК СпособОпределения,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ПорядокНаценки КАК ПорядокНаценки
	|ИЗ
	|	РегистрСведений.МинимальнаяСтоимостьПродукции.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	// №13380 |	И Подразделение = &Подразделение
	|				И Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВидЦены = &ВидЦены
	|				И ВЫБОР КОГДА &ОтборПоПродукции ТОГДА Шаблон = &ФактураШаблон 
	|				  ИНАЧЕ Фактура = &ФактураШаблон И ЦветФактуры = &ЦветФактуры
	|                 КОНЕЦ
	|	) КАК МинимальнаяСтоимостьПродукцииСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 		КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены", 		ВидЦены);
	
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	// №13380 Запрос.УстановитьПараметр("Подразделение", 	Подразделение);
	Запрос.УстановитьПараметр("Валюта", 		Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	
	Запрос.УстановитьПараметр("ОтборПоПродукции",	ТипЗнч(ФактураШаблон) = Тип("СправочникСсылка.ШаблоныПродукции"));
	Запрос.УстановитьПараметр("ФактураШаблон", 	ФактураШаблон);
	Запрос.УстановитьПараметр("ЦветФактуры", 	ЦветФактуры);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
